Fagear/SDVPCMdecoder/stc007line.cpp
#include "stc007line.h"

STC007Line::STC007Line()
{
    this->clear();
}

STC007Line::STC007Line(const STC007Line &in_object) : PCMLine(in_object)
{
    // Copy base class fields.
    PCMLine::operator =(in_object);
    // Copy own fields.
    mark_st_stage = in_object.mark_st_stage;
    mark_ed_stage = in_object.mark_ed_stage;
    marker_start_bg_coord = in_object.marker_start_bg_coord;
    marker_start_ed_coord = in_object.marker_start_ed_coord;
    marker_stop_ed_coord = in_object.marker_stop_ed_coord;
    // Copy data words.
    for(uint8_t index=0;index<WORD_CNT;index++)
    {
        words[index] = in_object.words[index];
        word_crc[index] = in_object.word_crc[index];
        word_valid[index] = in_object.word_valid[index];
    }
    // Copy pixel coordinates.
    for(uint8_t bit=0;bit<BITS_PCM_DATA;bit++)
    {
        for(uint8_t stage=0;stage<PCM_LINE_MAX_PS_STAGES;stage++)
        {
            pixel_coordinates[stage][bit] = in_object.pixel_coordinates[stage][bit];
        }
    }
}

STC007Line& STC007Line::operator= (const STC007Line &in_object)
{
    if(this==&in_object) return *this;

    // Copy base class fields.
    PCMLine::operator =(in_object);
    // Copy own fields.
    mark_st_stage = in_object.mark_st_stage;
    mark_ed_stage = in_object.mark_ed_stage;
    marker_start_bg_coord = in_object.marker_start_bg_coord;
    marker_start_ed_coord = in_object.marker_start_ed_coord;
    marker_stop_ed_coord = in_object.marker_stop_ed_coord;
    // Copy data words.
    for(uint8_t index=0;index<WORD_CNT;index++)
    {
        words[index] = in_object.words[index];
        word_crc[index] = in_object.word_crc[index];
        word_valid[index] = in_object.word_valid[index];
    }
    // Copy pixel coordinates.
    for(uint8_t bit=0;bit<BITS_PCM_DATA;bit++)
    {
        for(uint8_t stage=0;stage<PCM_LINE_MAX_PS_STAGES;stage++)
        {
            pixel_coordinates[stage][bit] = in_object.pixel_coordinates[stage][bit];
        }
    }

    return *this;
}

//------------------------ Reset all fields to default.
void STC007Line::clear()
{
    // Clear base class fields.
    PCMLine::clear();
    // Clear own fields.
    mark_st_stage = MARK_ST_START;
    mark_ed_stage = MARK_ED_START;
    marker_start_bg_coord = marker_start_ed_coord = marker_stop_ed_coord = 0;
    // Reset data words.
    setSilent();
    for(uint8_t index=0;index<WORD_CNT;index++)
    {
        // Reset per-word flags used for CWD.
        word_crc[index] = false;
        word_valid[index] = false;
    }
    // Reset pixel coordinates.
    for(uint8_t bit=0;bit<BITS_PCM_DATA;bit++)
    {
        for(uint8_t stage=0;stage<PCM_LINE_MAX_PS_STAGES;stage++)
        {
            pixel_coordinates[stage][bit] = 0;
        }
    }
    // Force CRC to be bad until good binarization.
    //calcCRC();
    calc_crc = CRC_SILENT;  // Pre-calculated CRC for silenced line.
    setInvalidCRC();        // Set "read" CRC to inverted one.
}

//------------------------ Set service flag "PCM control block".
void STC007Line::setServCtrlBlk()
{
    uint16_t id_word, address1_word, address2_word, ctrl_flags;
    uint16_t line;
    uint32_t frame;
    // Store Control Block data before clearing the line.
    id_word = words[WORD_CB_ID];
    address1_word = words[WORD_CB_ADDR1];
    address2_word = words[WORD_CB_ADDR2];
    ctrl_flags = words[WORD_CB_CTRL];
    // Save frame and line number.
    frame = frame_number;
    line = line_number;
    // Clear all fields.
    clear();
    // Restore frame and line number.
    frame_number = frame;
    line_number = line;
    // Restore Control Block data.
    words[WORD_CB_ID] = id_word;
    words[WORD_CB_ADDR1] = address1_word;
    words[WORD_CB_ADDR2] = address2_word;
    words[WORD_CB_CTRL] = ctrl_flags;
    // Update CRC.
    calcCRC();
    setSourceCRC(getCalculatedCRC());
    // Set service tag.
    service_type = SRVLINE_CTRL_BLOCK;
}

//------------------------ Set word with source CRC.
void STC007Line::setSourceCRC(uint16_t in_crc)
{
    words[WORD_CRCC_SH0] = in_crc;
}

//------------------------ Zero out all data words.
void STC007Line::setSilent()
{
    for(uint8_t i=WORD_L_SH0;i<=WORD_Q_SH336;i++)
    {
        words[i] = 0;
    }
    calcCRC();
}

//------------------------ Copy 14-bit word into object with its state.
void STC007Line::setWord(uint8_t index, uint16_t in_word, bool in_valid)
{
    if(index<WORD_CNT)
    {
        words[index] = in_word&0x3FFF;
        word_crc[index] = word_valid[index] = in_valid;
    }
}

//------------------------ Set word as fixed (no CRC error).
void STC007Line::setFixed(uint8_t index)
{
    if(index<WORD_CNT)
    {
        word_valid[index] = true;
    }
}

//------------------------ Force set marker detection stages to "markers exist" to bypass checks.
void STC007Line::forceMarkersOk()
{
    mark_st_stage = MARK_ST_BOT_2;
    mark_ed_stage = MARK_ED_LEN_OK;
}

//------------------------ Apply state of the line CRC to per-word state.
void STC007Line::applyCRCStatePerWord()
{
    for(uint8_t index=0;index<WORD_CNT;index++)
    {
        word_crc[index] = word_valid[index] = isCRCValid();
    }
}

//------------------------ Get number of data bits in the source line by the standard.
uint8_t STC007Line::getBitsPerSourceLine()
{
    return BITS_IN_LINE;
}

//------------------------ Get number of data bits between data coordinates (for PPB calculation).
uint8_t STC007Line::getBitsBetweenDataCoordinates()
{
    // Data coordinates capture 2nd, 3rd, 4th bits of START marker and 1 empty bit before STOP marker.
    return (3+BITS_PCM_DATA+1);
}

//------------------------ Get highest bit number for the left part of the line for pixel-shifting.
uint8_t STC007Line::getLeftShiftZoneBit()
{
    return BITS_LEFT_SHIFT;
}

//------------------------ Get lowest bit number for the right part of the line for pixel-shifting.
uint8_t STC007Line::getRightShiftZoneBit()
{
    return BITS_RIGHT_SHIFT;
}

//------------------------ Get pre-calculated coordinate of pixel in video line for requested PCM bit number and pixel-shifting stage.
//------------------------ [calcPPB()] MUST be called before any [findVideoPixel()] calls!
uint16_t STC007Line::getVideoPixelT(uint8_t pcm_bit, uint8_t shift_stage)
{
    return pixel_coordinates[shift_stage][pcm_bit];
}

//------------------------ Re-calculate CRCC for all words in the line.
void STC007Line::calcCRC()
{
    CRC16_init(&calc_crc);
    for(uint8_t i=WORD_L_SH0;i<=WORD_Q_SH336;i++)
    {
        calc_crc = getCalcCRC16(calc_crc, words[i], BITS_PER_WORD);
    }
#ifdef STC_LINE_EN_DBG_OUT
    QString log_line;
    log_line.sprintf("[STCL] Calculating CRC... %04x", calc_crc);
    qInfo()<<log_line;
#endif
}

