Fagear/SDVPCMdecoder/stc007line.cpp
//------------------------ Get CRC that was read from the source.
uint16_t STC007Line::getSourceCRC()
{
    return words[WORD_CRCC_SH0];
}

//------------------------ Get the type of PCM to determine class derived from [PCMLine];
uint8_t STC007Line::getPCMType()
{
    return TYPE_STC007;
}

//------------------------ Convert one 14-bit word to a 16-bit sample.
int16_t STC007Line::getSample(uint8_t index)
{
    uint16_t data_word;

    if(index<WORD_P_SH288)
    {
        data_word = words[index];
        // Convert 14-bit word to a 16-bit word.
        data_word = (data_word<<2);
    }
    else
    {
        // Index out-of-bounds.
        data_word = 0;
    }
    return (int16_t)data_word;
}

//------------------------ Get ID part of Control Block.
//------------------------ Negative result means an error.
int16_t STC007Line::getCtrlID()
{
    if(isServCtrlBlk()!=false)
    {
        return (words[WORD_CB_ID]&0x3FFF);
    }
    return -1;
}

//------------------------ Get Index code from Address part of Control Block.
//------------------------ Negative result means an error.
int8_t STC007Line::getCtrlIndex()
{
    if(isServCtrlBlk()!=false)
    {
        uint16_t tmp_ctrl;
        tmp_ctrl = words[WORD_CB_ADDR1];
        tmp_ctrl = (tmp_ctrl>>8);
        tmp_ctrl = tmp_ctrl&0x3F;
        return (int8_t)tmp_ctrl;
    }
    return -1;
}

//------------------------ Get Index code from Address part of Control Block.
//------------------------ Negative result means an error.
int8_t STC007Line::getCtrlHour()
{
    if(isServCtrlBlk()!=false)
    {
        uint16_t tmp_ctrl;
        tmp_ctrl = words[WORD_CB_ADDR1];
        tmp_ctrl = (tmp_ctrl>>4);
        tmp_ctrl = tmp_ctrl&0x0F;
        return (int8_t)tmp_ctrl;
    }
    return -1;
}

//------------------------ Get Index code from Address part of Control Block.
//------------------------ Negative result means an error.
int8_t STC007Line::getCtrlMinute()
{
    if(isServCtrlBlk()!=false)
    {
        uint16_t tmp_ctrl;
        tmp_ctrl = words[WORD_CB_ADDR2];
        tmp_ctrl = (tmp_ctrl>>12);
        tmp_ctrl = tmp_ctrl&0x03;
        tmp_ctrl += ((words[WORD_CB_ADDR1]&0x0F)<<2);
        return (int8_t)tmp_ctrl;
    }
    return -1;
}

//------------------------ Get Index code from Address part of Control Block.
//------------------------ Negative result means an error.
int8_t STC007Line::getCtrlSecond()
{
    if(isServCtrlBlk()!=false)
    {
        uint16_t tmp_ctrl;
        tmp_ctrl = words[WORD_CB_ADDR2];
        tmp_ctrl = (tmp_ctrl>>6);
        tmp_ctrl = tmp_ctrl&0x3F;
        return (int8_t)tmp_ctrl;
    }
    return -1;
}

//------------------------ Get Index code from Address part of Control Block.
//------------------------ Negative result means an error.
int8_t STC007Line::getCtrlFieldCode()
{
    if(isServCtrlBlk()!=false)
    {
        uint16_t tmp_ctrl;
        tmp_ctrl = words[WORD_CB_ADDR2];
        tmp_ctrl = tmp_ctrl&0x3F;
        return (int8_t)tmp_ctrl;
    }
    return -1;
}

//------------------------ Was PCM START-marker found in the line?
bool STC007Line::hasStartMarker()
{
    if(mark_st_stage==MARK_ST_BOT_2)
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Was PCM STOP-marker found in the line?
bool STC007Line::hasStopMarker()
{
    if(mark_ed_stage==MARK_ED_LEN_OK)
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Were both PCM markers found in the line?
bool STC007Line::hasMarkers()
{
    if((mark_st_stage==MARK_ST_BOT_2)&&(mark_ed_stage==MARK_ED_LEN_OK))
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Does provided line have the same words?
bool STC007Line::hasSameWords(STC007Line *in_line)
{
    bool equal;
    equal = true;
    if(in_line==NULL)
    {
        return false;
    }
    else
    {
        for(uint8_t index=WORD_L_SH0;index<=WORD_Q_SH336;index++)
        {
            if(words[index]!=in_line->words[index])
            {
                equal = false;
                break;
            }
        }
        return equal;
    }
}

//------------------------ Does this line contain control signal block (and no audio data)?
bool STC007Line::hasControlBlock()
{
    if((words[WORD_CB_CUE1]==0x3333)&&(words[WORD_CB_CUE2]==0x0CCC)
        &&(words[WORD_CB_CUE3]==0x3333)&&(words[WORD_CB_CUE4]==0x0CCC))
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Is CRC valid (re-calculated CRC is the same as read one)?
bool STC007Line::isCRCValidIgnoreForced()
{
    if(getCalculatedCRC()==getSourceCRC())
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Prohibition of digital dubbing.
bool STC007Line::isCtrlCopyProhibited()
{
    if(isServCtrlBlk()!=false)
    {
        if((words[WORD_CB_CTRL]&CTRL_COPY_MASK)!=0)
        {
            return true;
        }
    }
    return false;
}

//------------------------ Presence of P-word.
bool STC007Line::isCtrlEnabledP()
{
    if(isServCtrlBlk()!=false)
    {
        if((words[WORD_CB_CTRL]&CTRL_EN_P_MASK)==0)
        {
            return true;
        }
    }
    return false;
}

//------------------------ Presence of Q-word (14/16-bit mode).
bool STC007Line::isCtrlEnabledQ()
{
    if(isServCtrlBlk()!=false)
    {
        if((words[WORD_CB_CTRL]&CTRL_EN_Q_MASK)==0)
        {
            return true;    // 14-bit mode
        }
    }
    return false;   // 16-bit mode (PCM-F1 format)
}

//------------------------ Pre-emphasis of audio.
bool STC007Line::isCtrlEnabledEmphasis()
{
    if(isServCtrlBlk()!=false)
    {
        if((words[WORD_CB_CTRL]&CTRL_EMPH_MASK)==0)
        {
            return true;
        }
    }
    return false;
}

//------------------------ Is audio sample near zero value?
bool STC007Line::isNearSilence(uint8_t index)
{
    int16_t audio_sample;
    audio_sample = getSample(index);
    // Allow 2 LSBs (2 LSBs in 14-bit word become 4 LSBs in 16-bit state) wiggle room.
    if(audio_sample>=(int16_t)(1<<4))
    {
        return false;
    }
    if(audio_sample<(0-(int16_t)(1<<4)))
    {
        return false;
    }
    return true;
}

