Fagear/SDVPCMdecoder/stc007line.cpp
//------------------------ Are audio samples in both channels near zero?
bool STC007Line::isAlmostSilent()
{
    bool silent;
    silent = false;
    // Check if both channels are close to silence.
    if(((isNearSilence(WORD_L_SH0)!=false)||(isNearSilence(WORD_L_SH95)!=false)||(isNearSilence(WORD_L_SH190)!=false))&&
        ((isNearSilence(WORD_R_SH48)!=false)||(isNearSilence(WORD_R_SH143)!=false)||(isNearSilence(WORD_R_SH238)!=false)))
    {
        silent = true;
    }
    return silent;
}

//------------------------ Are all audio words zeroed?
bool STC007Line::isSilent()
{
    bool zero;
    zero = true;
    for(uint8_t index=WORD_L_SH0;index<=WORD_R_SH238;index++)
    {
        if(getSample(index)!=0)
        {
            zero = false;
            break;
        }
    }
    return zero;
}

//------------------------ Check if the line was fixed by CWD.
bool STC007Line::isFixedByCWD()
{
    if(isCRCValid()!=false)
    {
        for(uint8_t index=WORD_L_SH0;index<=WORD_Q_SH336;index++)
        {
            if((word_crc[index]==false)&&(word_valid[index]!=false))
            {
                return true;
            }
        }
    }
    return false;
}

//------------------------ Check if line has service tag "PCM control block".
bool STC007Line::isServCtrlBlk()
{
    if(service_type==SRVLINE_CTRL_BLOCK)
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Check if word is marked after binarization with CRC as "not damaged".
bool STC007Line::isWordCRCOk(uint8_t index)
{
    if(index<WORD_CNT)
    {
        if(forced_bad==false)
        {
            return word_crc[index];
        }
        else
        {
            return false;
        }
    }
    else
    {
        return false;
    }
}

//------------------------ Check if word is safe to playback (not damaged or fixed by ECC).
bool STC007Line::isWordValid(uint8_t index)
{
    if(index<WORD_CNT)
    {
        if(forced_bad==false)
        {
            return word_valid[index];
        }
        else
        {
            return false;
        }
    }
    else
    {
        return false;
    }
}

//------------------------ Get one word.
uint16_t STC007Line::getWord(uint8_t index)
{
    if(index<WORD_CNT)
    {
        return words[index];
    }
    else
    {
        return 0;
    }
}

//------------------------ Convert PCM data to string for debug.
std::string STC007Line::dumpWordsString()
{
    std::string text_out;
    uint8_t ind, bit_pos;
    // Printing header.
    if(hasStartMarker()==false)
    {
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
    }
    else
    {
        text_out += DUMP_BIT_ONE;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ONE;
        text_out += DUMP_BIT_ZERO;
    }

    // Printing 14 bit words data.
    for(ind=WORD_L_SH0;ind<=WORD_Q_SH336;ind++)
    {
        if(isWordCRCOk(ind)==false)
        {
            text_out += DUMP_WBRL_BAD;
        }
        else
        {
            text_out += DUMP_WBRL_OK;
        }
        bit_pos = BITS_PER_WORD;
        do
        {
            bit_pos--;
            if((words[ind]&(1<<bit_pos))==0)
            {
                if(isWordValid(ind)==false)
                {
                    text_out += DUMP_BIT_ZERO_BAD;
                }
                else
                {
                    text_out += DUMP_BIT_ZERO;
                }
            }
            else
            {
                if(isWordValid(ind)==false)
                {
                    text_out += DUMP_BIT_ONE_BAD;
                }
                else
                {
                    text_out += DUMP_BIT_ONE;
                }
            }
        }
        while(bit_pos>0);
        if(isWordCRCOk(ind)==false)
        {
            text_out += DUMP_WBRR_BAD;
        }
        else
        {
            text_out += DUMP_WBRR_OK;
        }
    }
    // Printing 16 bit CRCC data.
    if(isWordCRCOk(WORD_CRCC_SH0)==false)
    {
        text_out += DUMP_WBRL_BAD;
    }
    else
    {
        text_out += DUMP_WBRL_OK;
    }
    bit_pos = BITS_PER_CRC;
    do
    {
        bit_pos--;
        if((getSourceCRC()&(1<<bit_pos))==0)
        {
            if(isWordValid(WORD_CRCC_SH0)==false)
            {
                text_out += DUMP_BIT_ZERO_BAD;
            }
            else
            {
                text_out += DUMP_BIT_ZERO;
            }
        }
        else
        {
            if(isWordValid(WORD_CRCC_SH0)==false)
            {
                text_out += DUMP_BIT_ONE_BAD;
            }
            else
            {
                text_out += DUMP_BIT_ONE;
            }
        }
    }
    while(bit_pos>0);
    if(isWordCRCOk(WORD_CRCC_SH0)==false)
    {
        text_out += DUMP_WBRR_BAD;
    }
    else
    {
        text_out += DUMP_WBRR_OK;
    }
    // Printing footer.
    if(hasStopMarker()==false)
    {
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ZERO;
    }
    else
    {
        text_out += DUMP_BIT_ZERO;
        text_out += DUMP_BIT_ONE;
        text_out += DUMP_BIT_ONE;
        text_out += DUMP_BIT_ONE;
        text_out += DUMP_BIT_ONE;
    }

    return text_out;
}

//------------------------ Output full information about the line.
std::string STC007Line::dumpContentString()
{
    std::string text_out;
    char c_buf[256];

    if(isServiceLine()!=false)
    {
        if(isServNewFile()!=false)
        {
            sprintf(c_buf, "F[%03u] L[%03u] SERVICE LINE: next lines are from new file: %s", (unsigned int)frame_number, line_number, file_path.substr(0, 192).c_str());
            text_out += c_buf;
        }
        else if(isServEndFile()!=false)
        {
            sprintf(c_buf, "F[%03u] L[%03u] SERVICE LINE: previous lines were last in the file", (unsigned int)frame_number, line_number);
            text_out += c_buf;
        }
        else if(isServFiller()!=false)
        {
            sprintf(c_buf, "F[%03u] L[%03u] SERVICE LINE: line from a filler frame", (unsigned int)frame_number, line_number);
            text_out += c_buf;
        }
        else if(isServEndField()!=false)
        {
            sprintf(c_buf, "F[%03u] L[%03u] SERVICE LINE: field of a frame ended", (unsigned int)frame_number, line_number);
            text_out += c_buf;
        }
        else if(isServEndFrame()!=false)
        {
            sprintf(c_buf, "F[%03u] L[%03u] SERVICE LINE: frame ended", (unsigned int)frame_number, line_number);
            text_out += c_buf;
        }
        else if(isServCtrlBlk()!=false)
        {
            sprintf(c_buf, "F[%03u] SERVICE LINE: Control Block, ID=[%05d], Index=[%02d], Hour=[%02d], Min.=[%02d], Sec.=[%02d], Field=[%02d], CTRL=[0x%04X]: ",
                    (unsigned int)frame_number,
                    getCtrlID(),
                    getCtrlIndex(),
                    getCtrlHour(),
                    getCtrlMinute(),
                    getCtrlSecond(),
                    getCtrlFieldCode(),
                    words[WORD_CB_CTRL]);
            text_out += c_buf;
            if(isCtrlEnabledP()==false)
            {
                text_out += "P-code: OFF, ";
            }
            else
            {
                text_out += "P-code: ON,  ";
            }
            if(isCtrlEnabledQ()==false)
            {
                text_out += "Q-code: OFF, ";
            }
            else
            {
                text_out += "Q-code: ON,  ";
            }
            if(isCtrlEnabledEmphasis()==false)
            {
                text_out += "Emph.: OFF, ";
            }
            else
            {
                text_out += "Emph.: ON,  ";
            }
            if(isCtrlCopyProhibited()==false)
            {
                text_out += "Copy: ALLOW";
            }
            else
            {
                text_out += "Copy: DENY ";
            }
        }
    }
    else
    {
        sprintf(c_buf, "F[%03u] L[%03u] ", (unsigned int)frame_number, line_number);
        text_out += c_buf;

        if(hasBWSet()==false)
        {
            sprintf(c_buf, "Y[%03u?%03u] ", black_level, white_level);
            text_out += c_buf;
        }
        else
        {
            sprintf(c_buf, "Y[%03u|%03u] ", black_level, white_level);
            text_out += c_buf;
        }

