Fagear/SDVPCMdecoder/stc007line.cpp
        if(isDataByRefSweep()!=false)
        {
            sprintf(c_buf, "R>[%03u|%03u|%03u] S", ref_low, ref_level, ref_high);
        }
        else if(isDataBySkip()!=false)
        {
            sprintf(c_buf, "R=[%03u|%03u|%03u] S", ref_low, ref_level, ref_high);
        }
        else
        {
            sprintf(c_buf, "R?[%03u|%03u|%03u] S", ref_low, ref_level, ref_high);
        }
        text_out += c_buf;
        if(hasStartMarker()==false)
        {
            sprintf(c_buf, "%01u", mark_st_stage);
            text_out += c_buf;
        }
        else
        {
            text_out += "+";
        }
        if((isDataBySkip()!=false)&&(hasStartMarker()!=false))
        {
            sprintf(c_buf, "[%02d|%02d] ", marker_start_bg_coord, coords.data_start);
        }
        else
        {
            sprintf(c_buf, "[%02d:%02d] ", marker_start_bg_coord, coords.data_start);
        }
        text_out += c_buf;
        text_out += "["+dumpWordsString()+"] E";
        if(hasStopMarker()==false)
        {
            sprintf(c_buf, "%01d", mark_ed_stage);
            text_out += c_buf;
        }
        else
        {
            text_out += "+";
        }
        if((isDataBySkip()!=false)&&(hasStopMarker()!=false))
        {
            sprintf(c_buf, "[%04d|%04d] ", coords.data_stop, marker_stop_ed_coord);
        }
        else
        {
            sprintf(c_buf, "[%04d:%04d] ", coords.data_stop, marker_stop_ed_coord);
        }
        text_out += c_buf;

        if(isSilent()!=false)
        {
            text_out += "FS ";
        }
        else if(isAlmostSilent()!=false)
        {
            text_out += "AS ";
        }
        else
        {
            text_out += "NS ";
        }

        sprintf(c_buf, "PPB[%02u.%03u] ", getPPB(), getPPBfrac());
        text_out += c_buf;
        sprintf(c_buf, "HD[%02u] ", hysteresis_depth);
        text_out += c_buf;
        sprintf(c_buf, "SS[%01u] ", shift_stage);
        text_out += c_buf;
        sprintf(c_buf, "T[%05u] ", process_time);
        text_out += c_buf;

        if(isCRCValidIgnoreForced()!=false)
        {
            if(isForcedBad()!=false)
            {
                sprintf(c_buf, "BD CRC! [0x%04X] (forced)", getCalculatedCRC());
                text_out += c_buf;
            }
            else if(isFixedByCWD()!=false)
            {
                sprintf(c_buf, "FIXED   [0x%04X]", getCalculatedCRC());
                text_out += c_buf;
            }
            else
            {
                sprintf(c_buf, "CRC OK  [0x%04X]", getCalculatedCRC());
                text_out += c_buf;
            }
        }
        else if(hasMarkers()!=false)
        {
            sprintf(c_buf, "BD CRC! [0x%04X!=0x%04X]", getCalculatedCRC(), getSourceCRC());
            text_out += c_buf;
        }
        else
        {
            text_out += "No PCM!";
        }
    }
    return text_out;
}

//------------------------ Next line in help output.
std::string STC007Line::helpDumpNext()
{
    std::string text_out;
    if(help_stage<STC_LINE_HELP_SIZE)
    {
        text_out = STC007_HELP_LIST[help_stage];
        help_stage++;
    }
    else
    {
        text_out.clear();
    }
    return text_out;
}

//------------------------ Pre-calculate pixel coordinates list for given pixel shift stage.
void STC007Line::calcCoordinates(uint8_t in_shift)
{
    for(uint8_t bit=0;bit<BITS_PCM_DATA;bit++)
    {
        pixel_coordinates[in_shift][bit] = PCMLine::getVideoPixelC(bit, in_shift, 3);
    }
}
